app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `code`, `created_at`, `updated_at`) VALUES ('rwernu', 'Hello', '2018-02-25 20:38:22', '2018-02-25 20:38:22')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = 1
---
  def destroy
    @post.destroy

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
---
    def set_post
      @post = Post.find(params[:id])